brew "btop"
brew "gh"
brew "git"
brew "ripgrep"
brew "zsh"

brew "mise"
brew "ruby-build" # Required by mise to install ruby

cask "ghostty" # terminal
brew "wget"
cask "chatgpt"

# For ruby 2.* to work:
# brew "openssl@1.1"
# brew "readline"
# brew "libyaml"
# brew "gmp"

cask "latest" # Update apps easily
cask "maccy" # Clipboard manager
cask "rectangle" # Move and resize windows https://rectangleapp.com/
cask "stats" # System monitor in nav bar https://github.com/exelban/stats
cask "1password"
cask "1password-cli"
cask "claude"
cask "google-chrome"
cask "ngrok"
cask "postman"
cask "sublime-text"
cask "tablepro"
cask "visual-studio-code"
cask "chromedriver"
cask "slack"
cask "whatsapp"
cask "docker"
cask "spotify"
cask "zoom"
cask "betterdisplay" # Adjust brightness of external monitors https://betterdisplay.app/

brew "opensearch"

# RC
brew "awscli"
brew "aws-sso-cli"
brew "azure-cli"
brew "cloudflared"
brew "coreutils"
brew "direnv"
brew "docker-compose"
brew "lefthook"
brew "lychee"
brew "redis"
brew "typos-cli"
