brew "btop"
brew "gh"
brew "git"
brew "ripgrep"
brew "zsh"

brew "python" # or "pyenv"
brew "redis"
brew "pyenv"
brew "rbenv" 
brew "n" # node manager https://github.com/tj/n
brew "warp" 
brew "wget"
brew "yarn" 

# For ruby 2.* to work:
brew "openssl@1.1" 
brew "readline" 
brew "libyaml" 
brew "gmp"

cask "latest" # Update apps easily
cask "maccy" # Clipboard manager
cask "rectangle" # Move and resize windows https://rectangleapp.com/
cask "stats" # System monitor in nav bar https://github.com/exelban/stats
cask "1password"
cask "google-chrome"
cask "postman"
cask "sublime-text"
cask "visual-studio-code" 
cask "chromedriver"
cask "slack"
cask "whatsapp"
cask "docker"
cask "spotify"
cask "zoom"
tap "heroku/brew" 
brew "heroku" 
