brew "btop"
brew "gh"
brew "git"
brew "ripgrep"
brew "zsh"

brew "pyenv"
brew "redis"
brew "postgresql@16"
brew "rbenv"
brew "n" # node manager https://github.com/tj/n
# brew "uv" # python version and package manager
brew "warp" # terminal
brew "wget"
brew "skitch" # drawing arrows over images
brew "chatgpt"

# For ruby 2.* to work:
# brew "openssl@1.1"
# brew "readline"
# brew "libyaml"
# brew "gmp"

cask "latest" # Update apps easily
cask "maccy" # Clipboard manager
cask "rectangle" # Move and resize windows https://rectangleapp.com/
cask "stats" # System monitor in nav bar https://github.com/exelban/stats
cask "1password"
cask "google-chrome"
cask "postman"
cask "sublime-text"
cask "visual-studio-code"
cask "chromedriver"
cask "slack"
cask "whatsapp"
cask "docker"
cask "spotify"
cask "zoom"
cask "betterdisplay" # Adjust brightness of external monitors https://betterdisplay.app/

tap "heroku/brew"
brew "heroku"

brew "opensearch"
